import styles from '../../styles/map/Map.module.css';
import { useContext } from 'react';
import { MapContext } from '../../pages';

export const InfoHexSheet = () => {
  const { typeOfMap } = useContext(MapContext);

  return (
    <>
      {typeOfMap === 4 && (
        <div className={styles.hexSheetInfoWrapper}>
          <div className={styles.hexSheetTable}>
            <div>
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="24"
                height="24"
                viewBox="0 0 24 24"
                fill="none"
              >
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M7.81302 1L11.4391 3.09349V7.28048L7.81302 9.37397L4.18698 7.28048V3.09349L7.81302 1ZM16.187 1L19.813 3.09349V7.28048L16.187 9.37397L12.5609 7.28048V3.09349L16.187 1ZM24 10.0718L20.374 7.97831L16.7479 10.0718V14.2588L20.374 16.3523L24 14.2588V10.0718ZM16.187 14.9566L19.813 17.0501V21.2371L16.187 23.3306L12.5609 21.2371V17.0501L16.187 14.9566ZM15.626 10.0718L12 7.97831L8.37397 10.0718V14.2588L12 16.3523L15.626 14.2588V10.0718ZM7.81302 14.9566L11.4391 17.0501V21.2371L7.81302 23.3306L4.18698 21.2371V17.0501L7.81302 14.9566ZM7.25207 10.0718L3.62603 7.97831L0 10.0718V14.2588L3.62603 16.3523L7.25207 14.2588V10.0718Z"
                  fill="#d896e0"
                />
              </svg>
              <span>Объекты здравоохранения / образования</span>
            </div>
            <div>
              <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
              >
                <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M7.81302 1L11.4391 3.09349V7.28048L7.81302 9.37397L4.18698 7.28048V3.09349L7.81302 1ZM16.187 1L19.813 3.09349V7.28048L16.187 9.37397L12.5609 7.28048V3.09349L16.187 1ZM24 10.0718L20.374 7.97831L16.7479 10.0718V14.2588L20.374 16.3523L24 14.2588V10.0718ZM16.187 14.9566L19.813 17.0501V21.2371L16.187 23.3306L12.5609 21.2371V17.0501L16.187 14.9566ZM15.626 10.0718L12 7.97831L8.37397 10.0718V14.2588L12 16.3523L15.626 14.2588V10.0718ZM7.81302 14.9566L11.4391 17.0501V21.2371L7.81302 23.3306L4.18698 21.2371V17.0501L7.81302 14.9566ZM7.25207 10.0718L3.62603 7.97831L0 10.0718V14.2588L3.62603 16.3523L7.25207 14.2588V10.0718Z"
                    fill="#d45de3"
                />
              </svg>
              <span>Объекты здравоохранения / туризма</span>
            </div>
            <div>
              <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
              >
                <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M7.81302 1L11.4391 3.09349V7.28048L7.81302 9.37397L4.18698 7.28048V3.09349L7.81302 1ZM16.187 1L19.813 3.09349V7.28048L16.187 9.37397L12.5609 7.28048V3.09349L16.187 1ZM24 10.0718L20.374 7.97831L16.7479 10.0718V14.2588L20.374 16.3523L24 14.2588V10.0718ZM16.187 14.9566L19.813 17.0501V21.2371L16.187 23.3306L12.5609 21.2371V17.0501L16.187 14.9566ZM15.626 10.0718L12 7.97831L8.37397 10.0718V14.2588L12 16.3523L15.626 14.2588V10.0718ZM7.81302 14.9566L11.4391 17.0501V21.2371L7.81302 23.3306L4.18698 21.2371V17.0501L7.81302 14.9566ZM7.25207 10.0718L3.62603 7.97831L0 10.0718V14.2588L3.62603 16.3523L7.25207 14.2588V10.0718Z"
                    fill="#a3dee3"
                />
              </svg>
              <span>Объекты образования / туризма</span>
            </div>
          </div>
        </div>
      )}
    </>
  );
};